app/views/users/index.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
<% if @logged_in_user %>
  Hi <%= User.find(@logged_in_user).name%>!