app/views/users/show.erb

    <h3><u>Look at your favorites:</u></h3>
    <h2><%@user.likes.each do |like|%>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 34]]