app/controllers/brands_controller.rb

SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @brand = Brand.find(params[:id])