app/controllers/likes_controller.rb

  def create
    like = Like.create(user_id: session[:user_id], sneaker_id: params[:sneaker_id])
---
INSERT INTO "likes" ("user_id", "sneaker_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["sneaker_id", 3], ["created_at", "2019-04-16 18:39:29.636748"], ["updated_at", "2019-04-16 18:39:29.636748"]]

  def destroy
    @like = Like.find(params[:id])
    @like.destroy
---
SELECT  "likes".* FROM "likes" WHERE "likes"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 18]]