app/controllers/sneakers_controller.rb

  def index
    @sneakers = Sneaker.all
---
SELECT "sneakers".* FROM "sneakers"

  def new
    @sneaker= Sneaker.new
    @brands = Brand.all
---
SELECT "brands".* FROM "brands"

  def show
    @sneaker = Sneaker.find(params[:id])
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    sneaker = Sneaker.create(sneaker_params)
---
INSERT INTO "sneakers" ("title", "style", "brand_id", "created_at", "updated_at", "sneaker_img", "color") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @sneaker = Sneaker.find(params[:id])
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    @sneaker = Sneaker.find(params[:id])
    @sneaker.update(sneaker_params)
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "sneakers" SET "color" = ?, "sneaker_img" = ?, "updated_at" = ? WHERE "sneakers"."id" = ?  [["color", "Red/white"], ["sneaker_img", "https://hypexave.com/wp-content/uploads/2018/02/27707862_10214377089677000_1591795384_o.jpg"], ["updated_at", "2019-04-17 03:15:52.106073"], ["id", 5]]

  def destroy
    @sneaker = Sneaker.find(params[:id])
---
SELECT  "sneakers".* FROM "sneakers" WHERE "sneakers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def random
     @sneakers = Sneaker.all.sample
---
SELECT "sneakers".* FROM "sneakers"