app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.valid?
      @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?)  [["name", "josh"], ["created_at", "2019-04-18 17:45:31.326794"], ["updated_at", "2019-04-18 17:45:31.326794"], ["password_digest", "$2a$10$dIDrHhUmuKs4lBgXuLRrZeMpx5P7o95H5cxsUmI0bMXaKc9YMHNAK"]]