app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Herman"], ["LIMIT", 1]]
---
  def login
    session[:user_id] = User.find_by(name: params[:name]).id