app/views/brands/show.erb

SELECT "sneakers".* FROM "sneakers" WHERE "sneakers"."brand_id" = ?  [["brand_id", 1]]
---

<h2> <%@brand.sneakers.each do |sneaker| %></h2>